<template>
	<div class="clause" v-if="isHiede" >
		<div class="clause-head">
			<h2>《中国健康云用户服务协议》<span @click="clauseCode">关闭</span></h2>
		</div>
		<!--<div class="clause-content">
			<p>欢迎使用中国健康云会员在线注册服务！</p>
			<p>【审慎阅读】</p>
			<p>您在申请注册流程中点击同意本协议之前，应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用和争议解决条款。如您对协议有任何疑问，可向中国健康云在线客服咨询。如您未满18周岁，或以其他形式被限制民事行为能力，请在监护人的陪同下阅读本协议。
	本协议是您与中国健康云（简称“本站”，网址：www.zgjky.cn）所有者之间就中国健康云网站服务等相关事宜所订立的契约，您点击“开始注册”按钮后，本协议即构成对双方有约束力的法律文件。</p>
			<p>【入驻条件】</p>
			<p>中国健康云是由中国疾病预防控制中心慢性非传染性疾病预防控制中心指导，中华全国妇女联合会中国妇女儿童事业发展中心发起，利吾家健康管理有限公司运营，三方共建的以慢病防治为核心内容的国家级健康产业服务平台。只要您有一颗渴望健康的并愿意为家人、朋友、自己的健康付出努力的心，就可以入驻到我们平台，为中国的健康事业及您自身的健康添砖加瓦！</p>
			<p>【本站服务内容】</p>
			<p>1.中国健康云通过互联网实现个人、家庭以及团体用户的健康管理，为会员提供健康评估、在线健康咨询、高端健康产品以及O2O健康服务，用户同意所有注册协议条款并完成注册程序，才能成为本站的正式会员，享受中国健康云平台提供的全方位健康服务。</p>
			<p>2.用户点击同意本协议的，即视为用户确认自己具有享受本站服务、下单购物等相应的权利能力和行为能力，能够独立承担法律责任。</p>
			<p>3.本站仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。</p>
			<p>【会员权力】</p>
			<p>1.凡是本网站的会员，均可以获得注册商家或医生资格的权利；</p>
			<p>2.凡是本网站的会员，均可以使用本平台的各项功能及健康工具；</p>
			<p>3.凡是本网站的会员，均可以拥有参加平台活动的资格；</p>
			<p>4.凡是本网站的会员，均可以拥有投诉建议的资格； </p>
			<p>5.凡是本网站的会员，均可以建立自己的健康档案，根据健康数据生成个性化健康报告；</p>
			<p>6.凡是本网站的会员，均可以在线向医生、健康管理师、营养师等专家问诊，拥有自己的私人健康服务；</p>
			<p>7.凡是本网站的会员，均可以通过各种网站行为获得积分，可以获得优惠券、健康豆；</p>
			<p>8.凡是本网站的会员，均可以通过累计消费金额提升等级，获得更多优惠；</p>
			<p>9.凡是本网站的会员，均可以使用优惠券、余额等多种手段支付订单；</p>
			<p>10.凡是本网站的会员，均可以便捷地查询和管理我的订单；</p>
			<p>11.凡是本网站的会员，均可以参加会员专享的活动，获得我们最新的商品优惠信息。</p>
			<p>【会员义务】</p>
			<p>1.用户应自行诚信向本站提供注册资料，同意其提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新其注册资料。如果会员提供的注册资料不合法、不真实、不准确、不详尽的，会员需承担因此引起的相应责任及后果，并且中国健康云保留终止会员使用中国健康云各项服务的权利。</p>
			<p>2.会员在本站进行浏览、健康问诊、健康管理、下单购物等活动时，涉及会员真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到会员的授权或法律另有规定，本站不会向外界披露会员隐私信息。</p>
			<p>3.会员注册成功后，将产生会员名和密码等账户信息，您可以根据本站规定改变您的密码。会员应谨慎合理的保存、使用其会员名和密码。会员若发现任何非法使用会员账号或存在安全漏洞的情况，请立即通知本站并向公安机关报案。</p>
			<p>4.会员同意，中国健康云拥有通过邮件、短信电话等形式，向在本站注册、购物会员、收货人发送订单信息、促销活动等告知信息的权利。</p>
			<p>5.会员不得将在本站注册获得的账户借给他人使用，否则会员应承担由此产生的全部责任，并与实际使用人承担连带责任。</p>
			<p>6.会员同意，中国健康云有权使用会员的注册信息、用户名、密码等信息，登录进入会员的注册账户，进行证据保全，包括但不限于公证、见证等。</p>
			<p>7.依据国家相关法律法规规章制定，会员必须做到：</p>
			<p>不得利用本站危害国家安全、泄露国家秘密，不得侵犯国家社会集体的和公民的合法权益，不得利用本站制作、复制和传播下列信息：</p>
			<p>（1）煽动抗拒、破坏宪法和法律、行政法规实施的；</p>
			<p>（2）煽动颠覆国家政权，推翻社会主义制度的；</p>
			<p>（3）煽动分裂国家、破坏国家统一的；</p>
			<p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p>
			<p>（5）捏造或者歪曲事实，散布谣言，扰乱社会秩序的；</p>
			<p>（6）宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；</p>
			<p>（7）公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；</p>
			<p>（8）损害国家机关信誉的；</p>
			<p>（9）其他违反宪法和法律行政法规的；</p>
			<p>（10）进行商业广告行为的。</p>
			<p>8.未经本站的授权或许可，任何会员不得借用本站的名义从事任何商业活动，也不得将本站作为从事商业活动的场所、平台或其他任何形式的媒介。禁止将本站用作从事各种非法活动的场所、平台或者其他任何形式的媒介。违反者若触犯法律，一切后果自负，本站不承担任何责任。</p>
			<p>9.会员应不时关注并遵守本站不时公布或修改的各类合法规则规定。</p>
			<p>10.本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知会员的权利。</p>
	若会员未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭会员帐号等措施。会员须对自己在网上的言论和行为承担法律责任。</p>
			<p>【隐私保护】</p>
			<p>您注册本站相关服务时，根据要求提供相关个人信息；在您使用“中国健康云”服务、参加网站活动、或访问网站网页时，网站自动接收并记录的您浏览器上的服务器数据，包括但不限于IP地址、网站Cookie中的资料及您要求取用的网页记录；本站承诺不公开或透露您的密码、手机号码等在本站的非公开信息。除非因会员本人的需要、法律或其他合法程序的要求、服务条款的改变或修订等。</p>
			<p>为服务会员的目的，本站可能通过使用您的个人信息，向您提供服务，包括但不限于向您发出活动和服务信息等。</p>
			<p>同时会员须做到：</p>
			<p>● 会员名和昵称的注册与使用应符合网络道德，遵守中华人民共和国的相关法律法规。</p>
			<p>● 会员名和昵称中不能含有威胁、淫秽、漫骂、非法、侵害他人权益等有争议性的文字。</p>
			<p>● 注册成功后，会员必须保护好自己的帐号和密码，因会员本人泄露而造成的任何损失由会员本人负责。</p>
			<p>● 不得盗用他人帐号，由此行为造成的后果自负。</p>
			<p>您的个人信息将在下述情况下部分或全部被披露：</p>
			<p>● 经您同意，向第三方披露；</p>
			<p>● 如您是合资格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；</p>
			<p>● 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</p>
			<p>● 如果您出现违反中国有关法律或者网站政策的情况，需要向第三方披露；</p>
			<p>● 为提供你所要求的产品和服务，而必须和第三方分享您的个人信息；</p>
			<p>● 其他本网站根据法律或者网站政策认为合适的披露。</p>
			<p>【相关法律规范】</p>
			<p>1.用户一旦接受本协议，即表明该用户主动将其在任何时间段在本站发表的任何形式的信息内容（包括但不限于客户评价、客户咨询、各类话题文章等信息内容）的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给中国健康云所有，用户同意中国健康云有权就任何主体侵权而单独提起诉讼。</p>
			<p>2本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等权利转让书面协议，其效力及于用户在中国健康云网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本协议订立后。</p>
			<p>3.中国健康云是本站的制作者，拥有此网站内容及资源的著作权等合法权利，受国家法律保护，有权不时地对本协议及本站的内容进行修改，并在本站张贴，无须另行通知用户。在法律允许的最大限度范围内，中国健康云对本协议及本站内容拥有解释权。</p>
			<p>4.除法律另有强制性规定外，未经中国健康云明确的特别书面许可，任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用本站的信息内容，否则，中国健康云有权追究其法律责任。</p>
			<p>5.本站所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是中国健康云或其内容提供者的财产，受中国和国际版权法的保护。本站上所有内容的汇编是中国健康云的排他财产，受中国和国际版权法的保护。本站上所有软件都是中国健康云或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。</p>
			<p>6.中国健康云不对本站的运营及其包含在本网站上的信息、内容、材料、产品（包括软件）或服务作任何形式的、明示或默示的声明或担保（根据中华人民共和国法律另有规定的以外）。</p>
			<p>7.如因不可抗力或其它本站无法控制的原因使本站系统崩溃或无法正常使用导致网上行为无法完成或丢失有关的信息、记录等，中国健康云会合理地尽力协助处理善后事宜。</p>
			<p>【协议更新】</p>
			<p>根据国家法律法规变化及网站运营需要，中国健康云有权对本协议条款不时地进行修改，修改后的协议一旦被张贴在本站上即生效，并代替原来的协议。用户可随时登录查阅最新协议；用户有义务不时关注并阅读最新版的协议及网站公告。如用户不同意更新后的协议，可以且应立即停止接受中国健康云网站依据本协议提供的服务；如用户继续使用本网站提供的服务的，即视为同意更新后的协议。中国健康云建议您在使用本站之前阅读本协议及本站的公告。 如果本协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。</p>
			<p>【免责声明】</p>
			<p>1.基于技术和不可预见的原因而导致的服务中断，或者因会员的非法操作而造成的损失，本站不负责任。会员应当自行承担一切因自身行为而直接或者间接导致的民事或刑事法律责任。</p>
			<p>2.本站是为互联网用户提供信息存储空间的互联网服务提供者，对于任何包含、经由或连接、下载或从任何与有关本网站所获得的任何内容、信息或广告，不声明或保证其正确性或可靠性；并且对于用户经本网站上的内容、广告、展示而购买、取得的任何产品、信息或资料，本站不负保证责任。用户自行负担使用本网站的风险。</p>
			<p>3.本站内相关健康知识等信息内容仅代表发布者的个人观点，并不表示本站赞同其观点或证实其描述，本站不承担由此引发的法律责任。</p>
			<p>【其他】</p>
			<p>1.中国健康云网站所有者是指在政府部门依法许可或备案的中国健康云网站经营主体。</p>
			<p>2.中国健康云尊重用户和消费者的合法权利，本协议及本网站上发布的各类规则、声明等其他内容，均是为了更好的、更加便利的为用户和消费者提供服务。本站欢迎用户和社会各界提出意见和建议，中国健康云将虚心接受并适时修改本协议及本站上的各类规则。</p>
			<p>3.您点击本协议下方的“开始注册”按钮即视为您完全接受本协议，在点击之前请您再次确认已知悉并完全理解本协议的全部内容。</p>
		</div>-->

		<iframe src='/webserviceProxy/registerReadKnowledgeInfo.action?userType=1' width='100%' height="100%" border='0'></iframe>
	</div>
</template>
<script>
	export default {
		props:['jump'],
		data (){
			return {
				isHiede:this.jump
			}
		},
		methods: {
			clauseCode(){
				this.isHiede = false;
				this.$emit('child-event',this.isHiede);
			}
		},
		mounted () {
			
		}
	}
</script>
<style>
	.clause {
		top: 0;
		bottom:0;
		z-index: 9;
		background: #fff;
		position:fixed;  
		overflow-y:scroll;  
		overflow-x:hidden; 
		width: 100%;
		height:100%;
	}
	.clause iframe{
		border:none;
		padding-top: .84rem;
	}
	.clause-head {
		position: fixed;
		z-index: 2;
		width: 100%;
		height: .84rem;
		background-color: #009983;
		font-size: 14px;
		color: #fff;
		line-height: .84rem;
	}
	.clause-head h2 {
		margin: 0 0.125rem;
	}
	.clause-head h2 span {
		float: right;
		display: block;
		margin-right:.1rem;
	}
	.clause-content {
		width: 90%;
		margin: .95rem auto;
	}
	.clause-content p {
		font-size: 14px;
		color: #535353;
		text-indent: 2em;
		line-height: .6rem;
	}
</style>